LiteOS/LiteOS/platform/GD32F103VCT6/Library/Example/I2C/MasterTransmitter/main.c
/**
  ******************************************************************************
  * @file    I2C/MasterTransmitter/main.c
  * @author  MCU SD
  * @version V1.0
  * @date    26-Dec-2014
  * @brief   Main program body.
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "gd32f10x.h"

/* Private variables ---------------------------------------------------------*/
uint8_t I2C1_Buf_Write[16];

/* Private define ------------------------------------------------------------*/
#define I2C1_OWN_ADDRESS7    0x82
#define SLAVE_ADDRESS7       0x72

/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void GPIO_Configuration(void);
void I2C_Configuration(void);

/* Private functions ---------------------------------------------------------*/
/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
int main(void)
{
    int i;

    RCC_Configuration();
    GPIO_Configuration();
    I2C_Configuration();

    for(i=0;i<16;i++)
    {
        I2C1_Buf_Write[i]=i+0x80;
    }

    /* Enable I2C1 */
    I2C_Enable(I2C1,ENABLE);

    /* The software must wait until I2C Bus is idle */
    while(I2C_GetBitState(I2C1,I2C_FLAG_I2CBSY));

    /* Send a start condition to I2C bus */
    I2C_StartOnBus_Enable(I2C1,ENABLE);

    /* The software must wait until SBSEND bit is set */
    while(!I2C_StateDetect(I2C1,I2C_PROGRAMMINGMODE_MASTER_SBSEND));

    /* Send slave address to I2C bus */
    I2C_AddressingDevice_7bit(I2C1,SLAVE_ADDRESS7,I2C_DIRECTION_TRANSMITTER);

    /* The software must wait until ADDSEND bit is set */
    while(!I2C_StateDetect(I2C1,I2C_PROGRAMMINGMODE_MASTER_TRANSMITTER_ADDSEND));

    /* Wait until the transmit data buffer is empty */
    while(!I2C_GetBitState(I2C1,I2C_FLAG_TBE));

    for(i=0;i<16;i++)
    {
        /* Data transmission */
        I2C_SendData(I2C1,I2C1_Buf_Write[i]);
        while(!I2C_StateDetect(I2C1, I2C_PROGRAMMINGMODE_MASTER_BYTE_TRANSMITTED));
    }

    /* Send a stop condition to I2C bus */
    I2C_StopOnBus_Enable(I2C1,ENABLE);
    while(I2C1->CTLR1&0x0200);

    /* Infinite loop */
    while(1);
}

/**
  * @brief  Enable the peripheral clock.
  * @param  None
  * @retval None
  */
void RCC_Configuration(void)
{
    /* Enable GPIOB clock */
    RCC_APB2PeriphClock_Enable(RCC_APB2PERIPH_GPIOB,ENABLE);

    /* Enable I2C1  APB clock */
    RCC_APB1PeriphClock_Enable(RCC_APB1PERIPH_I2C1,ENABLE);
}

/**
  * @brief  Configure the GPIO ports.
  * @param  None
  * @retval None
  */
void GPIO_Configuration(void)
{
    GPIO_InitPara GPIO_InitStructure;

    /* I2C1 GPIO port */
    GPIO_InitStructure.GPIO_Pin =  GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_InitStructure.GPIO_Mode = GPIO_MODE_AF_OD;
    GPIO_InitStructure.GPIO_Speed = GPIO_SPEED_50MHZ;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
}

/**
  * @brief  Configure the I2C1 interface.
  * @param  None
  * @retval None
  */
void I2C_Configuration(void)
{
    I2C_InitPara I2C_InitStructure;
    I2C_InitStructure.I2C_Protocol = I2C_PROTOCOL_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DUTYCYCLE_2;
    I2C_InitStructure.I2C_BitRate = 100000;
    I2C_InitStructure.I2C_AddressingMode = I2C_ADDRESSING_MODE_7BIT;
    I2C_InitStructure.I2C_DeviceAddress = I2C1_OWN_ADDRESS7;
    I2C_Init(I2C1,&I2C_InitStructure);
}

/******************* (C) COPYRIGHT 2014 GIGADEVICE *****END OF FILE****/
